{"Knowledge":     {"0": "No evidence of recalling or recognizing facts or basic concepts.",     "1": "Minimal recall of some facts or basic concepts.",     "2": "Adequate recall of facts and basic concepts.",     "3": "Good recall and recognition of facts and basic concepts.",     "4": "Very good recall, recognition, and demonstration of understanding of facts and basic concepts.",     "5": "Excellent and complete recall and understanding of facts and basic concepts."}, "Comprehension":     {"0": "No evidence of understanding meanings or interpretations.",     "1": "Minimal understanding of basic meanings.",     "2": "Adequate explanation or summarization in learner’s own words.",     "3": "Good understanding and explanation of meanings or interpretations.",     "4": "Very good ability to explain and summarize concepts in learner’s own words.",     "5": "Excellent understanding, interpretation, and ability to convey concepts in learner’s own words."}, "Application":     {"0": "No evidence of applying knowledge to new situations.",     "1": "Minimal application of knowledge in a new situation.",     "2": "Adequate application of rules, methods, or concepts in a new situation.",     "3": "Good application and demonstration of the use of knowledge in new situations.",     "4": "Very good application of knowledge with clear examples in new situations.",     "5": "Excellent and innovative application of knowledge in various new situations."}, "Analysis":     {"0": "No evidence of breaking down information into parts.",     "1": "Minimal identification of elements and relationships.",     "2": "Adequate analysis by identifying motives or causes.",     "3": "Good analysis showing understanding of structure and relationships.",     "4": "Very good analysis with detailed breakdown of information.",     "5": "Excellent and thorough analysis, demonstrating deep understanding."}, "Synthesis":     {"0": "No evidence of compiling information in new ways.",     "1": "Minimal combining of elements in a basic pattern.",     "2": "Adequate compilation of information in a new structure.",     "3": "Good integration of diverse elements into a new pattern.",     "4": "Very good synthesis, creating new patterns or structures.",     "5": "Excellent synthesis, creating innovative and coherent new structures or patterns."}, "Evaluation":     {"0": "No evidence of making judgments or evaluations.",     "1": "Minimal ability to state an opinion or provide a simple assessment.",     "2": "Adequate judgments based on basic criteria.",     "3": "Good evaluation with clear and supported judgments.",     "4": "Very good evaluation, providing well-argued assessments.",     "5": "Excellent critical evaluations with comprehensive and insightful judgments."}}